Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: RESTEasy Reactive allows you to leverage the widely used and very powerful JAX-RS APIs to expose a REST layer for your application, while gaining a significant improvement in the maximum throughput the application can achieve. The application should also start slightly faster and consume a little less memory.
ja_jp: RESTEasy Reactive は、広く使用されている非常に強力な JAX-RS API を活用してアプリケーションの REST レイヤーを公開し、アプリケーションが達成できる最大スループットを大幅に向上させることができます。また、アプリケーションの起動がわずかに速くなり、メモリーの消費量が少し減ります。

source: RESTEasy Reactive and Coroutines
ja_jp: RESTEasy ReactiveとCoroutine

source: RESTEasy Reactive and Jackson.
ja_jp: RESTEasy Reactive と Jackson.

source: RESTEasy Reactive and REST Client Reactive interactions
ja_jp: RESTEasy リアクティブおよび REST クライアントリアクティブインタラクション

source: RESTEasy Reactive and it's Jackson support to handle JSON payloads
ja_jp: RESTEasy ReactiveとJSONペイロードを扱うためのJacksonサポート

source: RESTEasy Reactive and its Jackson support (to handle JSON) to serve the HTTP endpoint.
ja_jp: RESTEasy Reactive とその Jackson サポート (JSON を処理するため) による HTTP エンドポイントの提供。

source: RESTEasy Reactive and its Jackson support to handle JSON payloads
ja_jp: JSON ペイロードを処理するための RESTEasy Reactive とその Jackson サポート

source: RESTEasy Reactive by default handles each HTTP request on an IO thread (otherwise known as an event-loop thread)footnote:[More information about the execution model of RESTEasy Reactive can be found https://quarkus.io/guides/resteasy-reactive#execution-model-blocking-non-blocking[here]].
ja_jp: RESTEasy Reactive は、デフォルトでは IO スレッド(イベントループスレッドとして知られている)上の各 HTTP リクエストを処理します footnote:[RESTEasy Reactiveの実行モデルについて詳細は https://quarkus.io/guides/resteasy-reactive#execution-model-blocking-non-blocking[ここ] にあります]。

source: RESTEasy Reactive client
ja_jp: RESTEasy Reactive クライアント

source: RESTEasy Reactive does **not** support servlets. If your project depends on servlets you have to migrate them. A servlet-based JAX-RS implementation must support injections of these types with the `@Context` annotation: `ServletConfig`, `ServletContext`, `HttpServletRequest` and `HttpServletResponse`. Since RESTEasy Reactive is not servlet-based these injections will not work.
ja_jp: RESTEasy Reactiveはサーブレットをサポートして *いません* 。 プロジェクトが servlet に依存している場合は、それらを移行する必要があります。 サーブレット・ベースの JAX-RS 実装では、 `@Context` アノテーションを使用して、これらの型の注入をサポートする必要があります： `ServletConfig` 、 `ServletContext` 、 `HttpServletRequest` 、および `HttpServletResponse` 。 RESTEasy Reactive はサーブレットベースではないため、これらの注入は機能しません。

source: RESTEasy Reactive does not support the various custom annotation under the `org.jboss.resteasy.annotations` package.
ja_jp: RESTEasy Reactiveは、 `org.jboss.resteasy.annotations` パッケージの各種カスタムアノテーションには対応していません。

source: RESTEasy Reactive includes supports for Mutiny types (e.g. `Uni` and `Multi`) out of the box.
ja_jp: RESTEasy Reactive には、Mutiny タイプ (Uni や Multi など) のサポートが含まれています。

source: RESTEasy Reactive is a new link:{jaxrsspec}[JAX-RS] implementation written from the ground up to work on our common https://vertx.io/[Vert.x] layer and is thus fully reactive, while also being very tightly integrated with Quarkus and consequently moving a lot of work to build time.
ja_jp: RESTEasy Reactiveは、 link:https://vertx.io/[Vert.x] の共通レイヤー上で動作するように一から書かれた新しい link:{jaxrsspec}[JAX-RS]実装で、完全なリアクティブ性を備えています。

source: RESTEasy Reactive is a new link:{jaxrsspec}[Jakarta REST (formerly known as JAX-RS)] implementation written from the ground up to work on our common https://vertx.io/[Vert.x] layer and is thus fully reactive, while also being very tightly integrated with Quarkus and consequently moving a lot of work to build time.
ja_jp: RESTEasy Reactiveは、共通の link:https://vertx.io/[Vert.x] レイヤーで動作するようにゼロから書かれた新しい link:{jaxrsspec}[Jakarta REST（旧称JAX-RS）] の 実装で、完全にリアクティブです。また、Quarkusと非常に緊密に統合されており、結果として多くの作業をビルド時に移行します。

source: RESTEasy Reactive is able to gain its performance advantage over RESTEasy Classic by:
ja_jp: RESTEasy Reactive は、RESTEasy Classic と比較して、以下のような特徴を持っています。

source: RESTEasy Reactive is implemented using two main thread types:
ja_jp: RESTEasy Reactive は、次の 2 つのメインスレッドタイプを使用して実装されます。

source: RESTEasy Reactive is naturally integrated with Mutiny.
ja_jp: RESTEasy Reactiveは、Mutinyと自然に統合されています。

source: RESTEasy Reactive is our default REST layer and is a perfect fit for both reactive and blocking workloads.
ja_jp: RESTEasy Reactiveは、当社のデフォルトのRESTレイヤで、リアクティブとブロッキングの両方のワークロードに完璧に適合しています。

source: RESTEasy Reactive is ready to be tested
ja_jp: RESTEasy Reactiveは、すぐにテストできます。

source: RESTEasy Reactive is the next generation of HTTP framework. It unifies reactive (non-blocking IO, asynchronous APIs) and imperative (thanks to the `@Blocking` annotation). It improves raw performances without constraining the user experience. Its reactive/imperative duality makes it fit any use cases, from highly concurrent HTTP APIs, to more traditional transactional CRUD applications.
ja_jp: RESTEasy Reactive は次世代の HTTP フレームワークです。リアクティブ型 (ノンブロッキング IO、非同期 API) と命令型 (`@Blocking` アノテーションを使用) を統合しています。ユーザーエクスペリエンスを制限することなく、生のパフォーマンスを向上させます。その命令型/リアクティブ型の二面性により、高度に並列化された HTTP API から、より伝統的なトランザクション型の CRUD アプリケーションまで、あらゆるユースケースに適合するようになります。

source: RESTEasy Reactive keeps improving and it now has support for multipart.
ja_jp: RESTEasy Reactiveは改善を続け、multipartをサポートするようになりました。

source: RESTEasy Reactive natively supports the Mutiny reactive types e.g. `Uni` and `Multi`.
ja_jp: RESTEasy Reactive は、 `Uni` や `Multi` などの Mutiny リアクティブタイプをネイティブにサポートします。

source: RESTEasy Reactive provides the link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] and link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] annotations to facilitate handling HTTP caching semantics, i.e. setting the 'Cache-Control' HTTP header.
ja_jp: RESTEasy Reactive は、HTTP キャッシングセマンティックスの処理、つまり 'Cache-Control' HTTP ヘッダーの設定を容易にするために、link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] と link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] というアノテーションを提供します。

source: RESTEasy Reactive supports the use of the implementations of `java.time.Temporal` (like `java.time.LocalDateTime`) as query, path or form params. Furthermore it provides the `@org.jboss.resteasy.reactive.DateFormat` annotation which can be used to set a custom expected pattern (otherwise the JDK's default format for each type is used implicitly).
ja_jp: RESTEasy Reactiveは、 `java.time.Temporal` の実装（ `java.time.LocalDateTime` のような）を、クエリ、パス、フォームのパラメータとして使用することをサポートしています。さらに、 `@org.jboss.resteasy.reactive.DateFormat` アノテーションを提供しており、これを使用してカスタムの期待されるパターンを設定することができます（そうしないと、各タイプに対する JDK のデフォルトフォーマットが暗黙のうちに使用されます）。

source: RESTEasy Reactive supports the use of the implementations of `java.time.Temporal` (like `java.time.LocalDateTime`) as query, path or form params. Furthermore, it provides the `@org.jboss.resteasy.reactive.DateFormat` annotation which can be used to set a custom expected pattern (otherwise the JDK's default format for each type is used implicitly).
ja_jp: RESTEasy Reactiveは、 `java.time.Temporal` の実装（ `java.time.LocalDateTime` のような）を、クエリ、パス、フォームのパラメーターとして使用することをサポートしています。さらに、 `@org.jboss.resteasy.reactive.DateFormat` アノテーションを提供しており、これを使用してカスタムの期待されるパターンを設定することができます（そうしないと、各型に対する JDK のデフォルトフォーマットが暗黙のうちに使用されます）。

source: RESTEasy Reactive supports the use of the implementations of `java.time.Temporal` (like `java.time.LocalDateTime`) as query, path, or form params. Furthermore, it provides the `@org.jboss.resteasy.reactive.DateFormat` annotation, which can be used to set a custom expected pattern. Otherwise, the JDK's default format for each type is used implicitly.
ja_jp: RESTEasy Reactiveは、（ `java.time.LocalDateTime` のような） `java.time.Temporal` の実装をクエリ、パス、またはフォームのパラメータとして使用することをサポートしています。さらに、 `@org.jboss.resteasy.reactive.DateFormat` アノテーションを提供し、これを使用してカスタムの期待パターンを設定することができます。指定しない場合は、JDKの各型のデフォルトフォーマットが暗黙のうちに使用されます。

source: RESTEasy Reactive to serve HTTP requests
ja_jp: HTTP リクエストを処理する RESTEasy Reactive

source: RESTEasy Reactive used to expose REST endpoints
ja_jp: RESTEasy Reactiveは、RESTエンドポイントを公開するために使用されます。

source: RESTEasy Reactive, RESTEasy and Spring Web extension codestarts are part of https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[the base codestarts, window="_blank"].
ja_jp: RESTEasy、RESTEasy Reactive、Spring WebエクステンションのCodestartは、 link:https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[ベースの Codestart, window=_blank]の一部です。

source: RESTEasy Reactive: an implementation of JAX-RS tailored for the Quarkus architecture. It follows a reactive-first approach but allows imperative code using the `@Blocking` annotation.
ja_jp: RESTEasy Reactive: Quarkusアーキテクチャに合わせたJAX-RSの実装です。リアクティブファーストのアプローチを採用していますが、 `@Blocking` アノテーションを使用した命令型のコードも可能です。

source: RESTEasy Reactive: an implementation of Jakarta REST tailored for the Quarkus architecture. It follows a reactive-first approach but allows imperative code using the `@Blocking` annotation.
ja_jp: RESTEasy Reactive: Quarkusアーキテクチャに合わせたJakarta RESTの実装です。リアクティブファーストのアプローチを採用していますが、 `@Blocking` アノテーションを使用した命令型のコードも可能です。

source: RESTEasy Reactive: multipart form improvements
ja_jp: RESTEasy Reactive：multipart formの改善

source: RESTEasy _classic_ invokes the HTTP endpoint (the `hello` method in the previous snippet) on a worker thread associated with the HTTP request. It is a well-understood model, simple to understand. However, relying on worker threads introduces a concurrency limit: the number of threads.
ja_jp: RESTEasy _classic_ は、HTTP リクエストに関連付けられたワーカースレッド上で、HTTP エンドポイント（前のスニペットの `hello` メソッド）を呼び出します。これはよく理解されているモデルで、簡単に理解できます。しかし、ワーカースレッドに依存することで、同時実行の制限が発生します。

source: RESTEasy and Jackson.
ja_jp: RESTEasyとJackson。

source: RESTEasy and REST Client interactions
ja_jp: RESTEasy と RESTクライアントのやりとり

source: RESTEasy comes with a replacement API that you can inject: https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[`HttpRequest`], which has the methods https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[`getRemoteAddress()`] and https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[`getRemoteHost()`] to solve this problem.
ja_jp: RESTEasy には、注入できる代替 API https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[`HttpRequest`] が付属しています。この API には、この問題を解決するためのメソッド https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[`getRemoteAddress()`] および https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[`getRemoteHost()`] があります。

source: RESTEasy has rich support for the `multipart/*` and `multipart/form-data` mime types. The multipart mime format is used to pass lists of content bodies. Multiple content bodies are embedded in one message. `multipart/form-data` is often found in web application HTML Form documents and is generally used to upload files. The form-data format is the same as other multipart formats, except that each inlined piece of content has a name associated with it.
ja_jp: RESTEasyは、 `multipart/*` と `multipart/form-data` のマイムタイプを豊富にサポートしています。マルチパートマイムフォーマットは、コンテンツボディのリストを渡すために使用されます。 `multipart/form-data` は、Web アプリケーションのHTMLフォームドキュメントでよく見られ、一般的にはファイルのアップロードに使用されます。form-dataフォーマットは、他のマルチパートフォーマットと同じですが、インラインの各コンテンツには名前が関連付けられています。

source: RESTEasy supports multipart via the https://docs.jboss.org/resteasy/docs/4.5.6.Final/userguide/html/Multipart.html[RESTEasy Multipart Provider].
ja_jp: RESTEasy は https://docs.jboss.org/resteasy/docs/4.5.6.Final/userguide/html/Multipart.html[RESTEasy Multipart Provider] を介してマルチパートをサポートしています。

source: RESTEasy, RESTEasy Reactive and Spring Web extension codestarts are part of https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[the base codestarts, window="_blank"].
ja_jp: RESTEasy、RESTEasy Reactive、Spring Webのエクステンションコードスタートは、 link:https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[ベースコードスタート, window="_blank"] の一部です。

source: RP-initiated Logout
ja_jp: RP-initiated ログアウト

source: RP-initiated logout properties
ja_jp: RP-initiated ログアウトプロパティー

source: RSA Private Key PEM Content
ja_jp: RSA 秘密鍵 PEM コンテンツ

source: RSA Public Key PEM Content
ja_jp: RSA 公開鍵 PEM コンテンツ

source: RSA and Elliptic Curve (EC) private keys as well as symmetric secret keys can be used to sign the claims. `ES256` and `HS256` are the default algorithms for EC private and symmetric key algorithms respectively.
ja_jp: クレームの署名には、RSAや楕円曲線（EC）の秘密鍵のほか、対称性のある秘密鍵も使用できます。 `ES256` と `HS256` は、それぞれEC秘密鍵と対称鍵アルゴリズムのためのdefautアルゴリズムです。

source: RSA and Elliptic Curve (EC) private keys as well as symmetric secret keys can be used to sign the claims. `ES256` and `HS256` are the defaut algorithms for EC private and symmetric key algorithms respectively.
ja_jp: RSA、楕円曲線（EC）秘密鍵、対称鍵は、クレームの署名に使用することができます。 `ES256` と `HS256` は、それぞれEC秘密鍵と対称鍵アルゴリズムのためのデフォルトアルゴリズムです。

source: RSA and Elliptic Curve (EC) public keys as well as symmetric secret keys can be used to encrypt the claims. `ECDH-ES` and `A256KW` are the default algorithms for EC public and symmetric key encryption algorithms respectively.
ja_jp: RSA および Elliptic Curve (EC) 公開鍵、および対称秘密鍵を使用して、クレームを暗号化できます。 `ECDH-ES` と `A256KW` は、それぞれ EC 公開鍵と対称鍵の暗号化アルゴリズムのデフォルトアルゴリズムです。

source: RSA and Elliptic Curve (EC) public keys as well as symmetric secret keys can be used to encrypt the claims. `ECDH-ES` and `A256KW` are the defaut algorithms for EC public and symmetric key encryption algorithms respectively.
ja_jp: RSAおよび楕円曲線（EC）公開鍵、対称秘密鍵は、クレームの暗号化に使用することができます。 `ECDH-ES` および `A256KW` は、それぞれEC公開鍵および対称鍵暗号化アルゴリズムのデフォルトアルゴリズムです。

source: RSA private key PEM content
ja_jp: RSA 秘密鍵 PEM コンテンツ

source: RSA public key PEM content
ja_jp: RSA 公開鍵 PEM コンテンツ

source: RSS is for Resident Set Size memory usage.
ja_jp: RSS は常駐セットサイズ (Resident Set Size) メモリー使用量を指します。

source: RSS: Resident set size (kilobytes). This is the measure of how much memory space is actually being used
ja_jp: RSS: 常駐セットサイズ (Resident set size) (キロバイト)。これは実際に使用されているメモリー領域の大きさを示します。

source: RabbitMQ Client
ja_jp: RabbitMQクライアント

source: RabbitMQ Connector Configuration Reference
ja_jp: RabbitMQ コネクター設定のリファレンス

source: RabbitMQ Message Body
ja_jp: RabbitMQ メッセージの本文

source: RabbitMQ Messaging extension integrates with the xref:./tls-registry-reference.adoc[Quarkus TLS registry] to configure the Vert.x RabbitMQ client.
ja_jp: RabbitMQメッセージングエクステンションは、 xref:./tls-registry-reference.adoc[Quarkus TLSレジストリ] と統合して、Vert.x RabbitMQクライアントを設定します。

source: RabbitMQ Reference
ja_jp: RabbitMQリファレンス

source: RabbitMQ connector extension
ja_jp: RabbitMQ コネクターのエクステンション

source: RabbitMQ uses a default virtual host of `/`. To define additional RabbitMQ virtual hosts, provide the names of the virtual hosts in the `quarkus.rabbitmq.devservices.vhosts` key:
ja_jp: RabbitMQ はデフォルトの仮想ホストとして `/` を使用します。 追加の RabbitMQ 仮想ホストを定義するには、`quarkus.rabbitmq.devservices.vhosts` キーに仮想ホストの名前を指定してください。

source: Rate Limiting
ja_jp: レート制限

source: Rate limit is superficially similar to a bulkhead (concurrency limit), but is in fact quite different. Bulkhead limits the number of executions happening concurrently at any point in time. Rate limit limits the number of executions in a time window of some length, without considering concurrency.
ja_jp: 流量制御は表面的にはバルクヘッド (同時実行制限) に似ていますが、実際はまったく異なります。バルクヘッドは、任意の時点で同時に発生する実行数を制限します。流量制御は、同時実行を考慮せずに、一定の時間枠内での実行数を制限します。

source: Rate limits need to maintain some state between invocations: the number of recent invocations, the time stamp of last invocation, and so on. This state is a singleton, irrespective of the lifecycle of the bean that uses the `@RateLimit` annotation.
ja_jp: 流量制御では、呼び出しと呼び出しの間で何らかの状態を維持する必要があります。たとえば、最近の呼び出し回数、最後の呼び出しのタイムスタンプなどです。この状態はシングルトンで、`@RateLimit` アノテーションを使用する Bean のライフサイクルは関係ありません。

source: Rather than enabling caching on mutable data, ideally a better solution would be to use a clustered cache; however at this time Quarkus doesn't provide any such implementation: feel free to get in touch and let this need known so that the team can take this into account.
ja_jp: 理想的には、変更可能なデータでキャッシュを有効にするのではなく、クラスタ化されたキャッシュを使用することがより良い解決策です。しかし、現時点では、Quarkusはそのような実装を提供していません：この必要性を知らせれば、チームがこれを考慮することができますので、お気軽にご連絡ください。

source: Rather than replacing one another, these modes form a spectrum of trade-offs. Native image remains unmatched for startup and minimal footprint. Leyden strengthens the JVM startup story.
ja_jp: これらのモードは互いに置き換わるのではなく、トレードオフのスペクトルを形成します。ネイティブイメージは起動と最小フットプリントにおいて比類がありません。Leyden は JVM の起動の利点を強化します。

source: Raw data
ja_jp: 生データ

source: Raw data pages
ja_jp: 生データページ

source: Raw numbers
ja_jp: 生の値

source: Re-augment a Quarkus Application
ja_jp: Quarkusアプリケーションの再オーグメンテーション

source: Re-augmentation is the process of recreating the augmentation output for a different build time configuration
ja_jp: 再オーグメンテーションとは、オーグメンテーション出力を異なるビルド時の設定で再作成するプロセスです。

source: Re-augmentation is useful in case the users of your application want to be able to change some of its build time properties. For instance changing the database driver or switching features on or off (e.g. xref:opentelemetry.adoc[OpenTelemetry] or link:{config-consul-guide}[Config Consul]). If there are only two or three build time properties that depend on the user environment, you may consider providing alternative builds of the application. However, in case there are more such properties you may prefer shipping a mutable jar instead and let your users re-augment the application for their environment. Please notice that you won't be able to use native images with the package type `mutable-jar`. Think of the consequences and what other options you have!
ja_jp: 再オーグメンテーションは、アプリケーションのユーザーがビルド時のプロパティーの一部を変更できるようにしたい場合に便利です。 たとえば、データベースドライバーの変更や、機能のオン/オフ (例: xref:opentelemetry.adoc[OpenTelemetry] または link:{config-consul-guide}[Config Consul]) などの場合に便利です。 ユーザー環境に依存するビルド時のプロパティーが 2 つか 3 つしかない場合は、アプリケーションの代替ビルドの提供を検討してもよいでしょう。しかし、そのようなプロパティーが多い場合は、代わりに変更可能な jar を配布し、ユーザーが自分の環境に合わせてアプリケーションを再調整できるようにする方が良いかもしれません。 パッケージタイプ `mutable-jar` では、ネイティブイメージを使用できない点に注意してください。 その結果と、他にどんな選択肢があるかを考えてみてください。

source: Re-augmentation is useful in case the users of your application want to be able to change some of its build time properties. For instance changing the database driver or switching features on or off (e.g. xref:opentracing.adoc[OpenTracing] or link:{config-consul-guide}[Config Consul]). If there are only two or three build time properties that depend on the user environment, you may consider providing alternative builds of the application. However, in case there are more such properties you may prefer shipping a mutable jar instead and let your users re-augment the application for their environment. Please notice that you won't be able to use native images with the package type `mutable-jar`. Think of the consequences and what other options you have!
ja_jp: 再オーグメンテーションは、アプリケーションのユーザーがビルド時のプロパティの一部を変更できるようにしたい場合に便利です。例えば、データベースドライバの変更や、機能のオン/オフ（例： link:opentracing[opentracing]や link:consul-config[consul-config]）などです。ユーザー環境に依存するビルド時のプロパティが2つか3つしかない場合は、アプリケーションの代替ビルドの提供を検討してもよいでしょう。しかし、プロパティが多い場合には、代わりに変更可能なjarを出荷し、ユーザーが自分の環境に合わせてアプリケーションを再オーグメンテーションすることを好むかもしれません。なお、パッケージタイプ `mutable-jar` では、ネイティブイメージを使用することはできません。その結果と、他にどんな選択肢があるかを考えてみてください。

source: Re-read during startup (native executable)
ja_jp: 起動時の再読取（ネイティブ実行可能ファイル）

source: Reactive
ja_jp: リアクティブ

source: Reactive API for Hibernate ORM
ja_jp: Hibernate ORMのためのReactive API

source: Reactive Applications
ja_jp: リアクティブ・アプリケーション

source: Reactive DB2 Configuration
ja_jp: リアクティブな DB2 の設定

source: Reactive DB2 client
ja_jp: Reactive DB2 クライアント

source: Reactive DB2 configuration
ja_jp: Reactive DB2 設定

source: Reactive Datasource
ja_jp: リアクティブデータソース

source: Reactive Datasource Configuration Reference
ja_jp: リアクティブデータソース構成リファレンス

source: Reactive Datasource URL Reference
ja_jp: リアクティブデータソース構成リファレンス

source: Reactive Entities and Repositories
ja_jp: リアクティブエンティティとレポジトリー

source: Reactive MariaDB/MySQL Specific Configuration
ja_jp: リアクティブな MariaDB/MySQL 固有の設定

source: Reactive MariaDB/MySQL specific configuration
ja_jp: Reactive MariaDB/MySQL固有の設定

source: Reactive Messaging
ja_jp: リアクティブメッセージング

source: Reactive Messaging (Kafka, AMQP)
ja_jp: リアクティブ・メッセージング（Kafka、AMQP）

source: Reactive Messaging AMQP 1.0 Connector Reference Documentation
ja_jp: リアクティブメッセージング AMQP1.0 コネクターリファレンスドキュメント

source: Reactive Messaging RabbitMQ Connector Reference Documentation
ja_jp: リアクティブメッセージング RabbitMQ コネクターのリファレンスドキュメント

source: Reactive Messaging _startup_ and _readiness_ checks offer two strategies. The default strategy verifies that an active connection is established with the broker. This approach is not intrusive as it's based on built-in Kafka client metrics.
ja_jp: Reactive Messaging の _startup_ および _readiness_ チェックには、2 つのストラテジーがあります。デフォルトのストラテジーでは、ブローカーとの間にアクティブな接続が確立されていることを確認します。この方法は、組み込みの Kafka クライアントメトリクスに基づいているため、邪魔になることはありません。

source: Reactive Messaging invokes user's methods on an I/O thread. Thus, by default, the methods must not block. As described in <<blocking-processing>>, you need to add the `@Blocking` annotation on the method if this method will block the caller thread.
ja_jp: Reactive Messaging は、I/O スレッドでユーザーのメソッドを呼び出します。 したがって、デフォルトではメソッドはブロックされません。 <<blocking-processing>> で説明されているように、このメソッドが呼び出し元スレッドをブロックする場合は、メソッドに `@Blocking` アノテーションを追加する必要があります。

source: Reactive Messaging invokes user's methods on an I/O thread. Thus, by default, the methods must not block. As described in xref:blocking-processing[Blocking processing], you need to add the `@Blocking` annotation on the method if this method will block the caller thread.
ja_jp: Reactive Messagingは、I/Oスレッド上でユーザーのメソッドを呼び出します。したがって、デフォルトでは、メソッドはブロックしてはいけません。 xref:blocking-processing[ブロック処理] で説明したように、このメソッドが呼び出し元のスレッドをブロックする場合は、メソッドに `@Blocking` アノテーションを追加する必要があります。

source: Reactive Messaging invokes your method on an I/O thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you often need to combine Reactive Messaging with blocking processing such as database interactions. For this, you need to use the `@Blocking` annotation indicating that the processing is _blocking_ and should not be run on the caller thread.
ja_jp: リアクティブメッセージングは、I/O スレッドでメソッドを呼び出します。このトピックの詳細については、xxref:quarkus-reactive-architecture.adoc[Quarkus リアクティブアーキテクチャーのドキュメント] を参照してください。ただし、多くの場合、リアクティブメッセージングとデータベースインタラクションなどのブロック処理を組み合わせる必要があります。このためには、処理が _ブロッキング_ であり、呼び出し元のスレッドで実行するべきではないことを示す `@Blocking` アノテーションを使用する必要があります。

source: Reactive Messaging invokes your method on an I/O thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you often need to combine Reactive Messaging with blocking processing, such as database interactions. For this, you need to use the `@Blocking` annotation indicating that the processing is _blocking_ and should not be run on the caller thread.
ja_jp: Reactive Messaging は、 I/O スレッド上でメソッドを呼び出します。このトピックの詳細については、 xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture ドキュメント] を参照してください。しかし、データベースのやり取りなど、 Reactive Messaging とブロッキング処理を組み合わせる必要があることがよくあります。このためには、処理が _ブロッキング_ であり、呼び出し元スレッドで実行すべきではないことを示す `@Blocking` アノテーションを使用する必要があります。
